Revit 2024 API
BuiltInFailures.AnalyticalModelFailures.CannotKeepAnalyticalAdjustment Property
 Analytical model Adjustment distance exceeds current Adjustment Snapping Distance. To adjust snap settings, go to the Structural Settings Dialog.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Syntax
C#
public static FailureDefinitionId CannotKeepAnalyticalAdjustment { get; }
Visual Basic
Public Shared ReadOnly Property CannotKeepAnalyticalAdjustment As FailureDefinitionId
	Get
Visual C++
public:
static property FailureDefinitionId^ CannotKeepAnalyticalAdjustment {
	FailureDefinitionId^ get ();
}
See Also
BuiltInFailures.AnalyticalModelFailures Class
Autodesk.Revit.DB Namespace